coocox/Mplib/Toshaba/TMPM36x/TMPM364/cmsis_lib/lib/cmsis_boot/startup/iar/startup_TMPM364.s
                PUBWEAK INTADM0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTADM0_IRQHandler
                B       INTADM0_IRQHandler

                PUBWEAK INTADM1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTADM1_IRQHandler
                B       INTADM1_IRQHandler

                PUBWEAK INTTB0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB0_IRQHandler
                B       INTTB0_IRQHandler

                PUBWEAK INTTB1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB1_IRQHandler
                B       INTTB1_IRQHandler

                PUBWEAK INTTB2_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB2_IRQHandler
                B       INTTB2_IRQHandler

                PUBWEAK INTTB3_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB3_IRQHandler
                B       INTTB3_IRQHandler

                PUBWEAK INTTB4_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB4_IRQHandler
                B       INTTB4_IRQHandler

                PUBWEAK INTTB5_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB5_IRQHandler
                B       INTTB5_IRQHandler

                PUBWEAK INTTB6_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB6_IRQHandler
                B       INTTB6_IRQHandler

                PUBWEAK INTTB7_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB7_IRQHandler
                B       INTTB7_IRQHandler

                PUBWEAK INTTB8_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB8_IRQHandler
                B       INTTB8_IRQHandler

                PUBWEAK INTTB9_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTB9_IRQHandler
                B       INTTB9_IRQHandler

                PUBWEAK INTTBA_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTBA_IRQHandler
                B       INTTBA_IRQHandler

                PUBWEAK INTTBB_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTBB_IRQHandler
                B       INTTBB_IRQHandler

                PUBWEAK INTTBC_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTBC_IRQHandler
                B       INTTBC_IRQHandler

                PUBWEAK INTTBD_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTBD_IRQHandler
                B       INTTBD_IRQHandler

                PUBWEAK INTTBE_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTBE_IRQHandler
                B       INTTBE_IRQHandler

                PUBWEAK INTTBF_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTTBF_IRQHandler
                B       INTTBF_IRQHandler

                PUBWEAK INTUSB_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTUSB_IRQHandler
                B       INTUSB_IRQHandler

                PUBWEAK INTCANGB_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCANGB_IRQHandler
                B       INTCANGB_IRQHandler

                PUBWEAK INTAD_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTAD_IRQHandler 
                B       INTAD_IRQHandler 

                PUBWEAK INTSSP_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTSSP_IRQHandler 
                B       INTSSP_IRQHandler

                PUBWEAK INTRX5_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTRX5_IRQHandler
                B       INTRX5_IRQHandler

                PUBWEAK INTTX5_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTTX5_IRQHandler
                B       INTTX5_IRQHandler

                PUBWEAK INTRX6_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTRX6_IRQHandler
                B       INTRX6_IRQHandler

                PUBWEAK INTTX6_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTTX6_IRQHandler
                B       INTTX6_IRQHandler

                PUBWEAK INTRX7_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTRX7_IRQHandler
                B       INTRX7_IRQHandler

                PUBWEAK INTTX7_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTTX7_IRQHandler
                B       INTTX7_IRQHandler

                PUBWEAK INTRX8_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTRX8_IRQHandler
                B       INTRX8_IRQHandler

                PUBWEAK INTTX8_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTTX8_IRQHandler
                B       INTTX8_IRQHandler

                PUBWEAK INTRX9_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTRX9_IRQHandler
                B       INTRX9_IRQHandler

                PUBWEAK INTTX9_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTTX9_IRQHandler
                B       INTTX9_IRQHandler

                PUBWEAK INTRX10_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTRX10_IRQHandler
                B       INTRX10_IRQHandler

                PUBWEAK INTTX10_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTTX10_IRQHandler
                B       INTTX10_IRQHandler

                PUBWEAK INTRX11_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTRX11_IRQHandler
                B       INTRX11_IRQHandler

                PUBWEAK INTTX11_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTTX11_IRQHandler
                B       INTTX11_IRQHandler

                PUBWEAK INTCAP10_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP10_IRQHandler
                B       INTCAP10_IRQHandler

                PUBWEAK INTCAP11_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP11_IRQHandler
                B       INTCAP11_IRQHandler

                PUBWEAK INTCAP20_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAP20_IRQHandler
                B       INTCAP20_IRQHandler

                PUBWEAK INTCAP21_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP21_IRQHandler
                B       INTCAP21_IRQHandler

