coocox/Mplib/Toshaba/TMPM36x/TMPM364/cmsis_lib/lib/cmsis_boot/startup/iar/startup_TMPM364.s
                PUBWEAK INTCANRX_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCANRX_IRQHandler
                B       INTCANRX_IRQHandler

                PUBWEAK INTCANTX_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCANTX_IRQHandler
                B       INTCANTX_IRQHandler

                PUBWEAK INTCAP50_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP50_IRQHandler
                B       INTCAP50_IRQHandler

                PUBWEAK INTCAP51_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP51_IRQHandler
                B       INTCAP51_IRQHandler

                PUBWEAK INTCAP60_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP60_IRQHandler
                B       INTCAP60_IRQHandler

                PUBWEAK INTCAP61_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP61_IRQHandler
                B       INTCAP61_IRQHandler

                PUBWEAK INTCAP70_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP70_IRQHandler
                B       INTCAP70_IRQHandler

                PUBWEAK INTCAP71_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP71_IRQHandler
                B       INTCAP71_IRQHandler

                PUBWEAK INTCAP90_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP90_IRQHandler
                B       INTCAP90_IRQHandler

                PUBWEAK INTCAP91_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAP91_IRQHandler
                B       INTCAP91_IRQHandler

                PUBWEAK INTCAPA0_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAPA0_IRQHandler
                B       INTCAPA0_IRQHandler

                PUBWEAK INTCAPA1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAPA1_IRQHandler
                B       INTCAPA1_IRQHandler

                PUBWEAK INTCAPB0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAPB0_IRQHandler
                B       INTCAPB0_IRQHandler

                PUBWEAK INTCAPB1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAPB1_IRQHandler
                B       INTCAPB1_IRQHandler

                PUBWEAK INTCAPD0_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAPD0_IRQHandler
                B       INTCAPD0_IRQHandler

                PUBWEAK INTCAPD1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAPD1_IRQHandler
                B       INTCAPD1_IRQHandler 

                PUBWEAK INTCAPE0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAPE0_IRQHandler
                B       INTCAPE0_IRQHandler

                PUBWEAK INTCAPE1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAPE1_IRQHandler
                B       INTCAPE1_IRQHandler

                PUBWEAK INTCAPF0_IRQHandler 
                SECTION .text:CODE:REORDER(1)
INTCAPF0_IRQHandler
                B       INTCAPF0_IRQHandler

                PUBWEAK INTCAPF1_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTCAPF1_IRQHandler
                B       INTCAPF1_IRQHandler

                PUBWEAK INTDMACERR_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMACERR_IRQHandler
                B       INTDMACERR_IRQHandler

                PUBWEAK INTDMACTC0_IRQHandler
                SECTION .text:CODE:REORDER(1)
INTDMACTC0_IRQHandler
                B       INTDMACTC0_IRQHandler

                END
